In [1]:
import pandas as pd
import numpy as np

This is a study based on the question:
https://stackoverflow.com/questions/41808951/pandas-group-by-cumsum-keep-columns

The df is not given, but I'd like to work on cumsum and percenatage, as well as keeping all rows.

In [5]:
data = """
0  Jack  2016-01-31      10
1  Jack  2016-02-29       5
2  Jack  2016-02-29       8
3  Jill  2016-01-31      10
4  Jill  2016-02-29       5
""".strip().split('\n')

data = [
    row.split()[1:] for row in data
]
data

[['Jack', '2016-01-31', '10'],
 ['Jack', '2016-02-29', '5'],
 ['Jack', '2016-02-29', '8'],
 ['Jill', '2016-01-31', '10'],
 ['Jill', '2016-02-29', '5']]

In [10]:
df = pd.DataFrame(data, columns='Name Date  Amount'.split())
df.Amount = df.Amount.astype(int)
df

   Name        Date  Amount
0  Jack  2016-01-31      10
1  Jack  2016-02-29       5
2  Jack  2016-02-29       8
3  Jill  2016-01-31      10
4  Jill  2016-02-29       5

In [12]:
df['day_so_far'] = df.groupby(['Name', 'Date'])['Amount'].cumsum()
df

   Name        Date  Amount  day_so_far
0  Jack  2016-01-31      10          10
1  Jack  2016-02-29       5           5
2  Jack  2016-02-29       8          13
3  Jill  2016-01-31      10          10
4  Jill  2016-02-29       5           5

In [17]:
g = df.groupby(['Name'])['Amount']
g.cumcount() + 1

0    1
1    2
2    3
3    1
4    2
dtype: int64

In [46]:
dfs = df.sample(4)
# dfs.merge(dfs, pd.DataFrame(dfs.groupby(['Name'])['Amount'].cumcount()), left_index=True, right_index=True)
dfs, pd.DataFrame(dfs.groupby(['Name'])['Amount'].cumcount())

(   Name        Date  Amount  day_so_far
 1  Jack  2016-02-29       5           5
 0  Jack  2016-01-31      10          10
 2  Jack  2016-02-29       8          13
 3  Jill  2016-01-31      10          10,    0
 1  0
 0  1
 2  2
 3  0)

In [32]:
pd.DataFrame(df.sample(4).groupby(['Name'])['Amount'].cumcount())

   0
2  0
4  0
1  1
0  2

In [49]:
df.groupby(by=['Name','Date'])['Amount'].sum().groupby(level='Name').cumsum()

Name  Date
Jack  2016-01-31    10
      2016-02-29    23
Jill  2016-01-31    10
      2016-02-29    15
Name: Amount, dtype: int64

In [50]:
df.groupby(by=['Name','Date'])['Amount'].sum().groupby(level='Name').cumsum().unstack()

Date  2016-01-31  2016-02-29
Name
Jack          10          23
Jill          10          15

In [51]:
df.groupby(by=['Name','Date'])['Amount'].sum().groupby(level='Name').cumsum().reset_index()

   Name        Date  Amount
0  Jack  2016-01-31      10
1  Jack  2016-02-29      23
2  Jill  2016-01-31      10
3  Jill  2016-02-29      15

In [52]:
df.groupby(by=['Name','Date'])['Amount'].sum().groupby(level='Name').cumsum().reset_index(name='Total_after_day')

   Name        Date  Total_after_day
0  Jack  2016-01-31               10
1  Jack  2016-02-29               23
2  Jill  2016-01-31               10
3  Jill  2016-02-29               15